## 행과 열 추출
- 열 추출
    - 하나의 열 : 데이터프레임[열이름]
    - 여러 개 열: 데이터프레임[[열이름1, 열이름2]]
    
- 행 추출
    - 하나의 행 : 데이터프레임[행이름1:행이름2]
    - 여러 개 행 : 데이터프레임[행이름1:행이름3]
    - 하나의 행 : 데이터프레임[0:1] -> 첫 번째 행 추출
    - 여러 개 행 : 데이터프레임[0:3] -> 첫 번째, 두 번째 행 추출

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    [
        range(1,21,2),
        range(2,21,2),
        range(10,101,10)
    ], 
    index = ['row1', 'row2', 'row3'],
    columns=[f'co{r}'for r in range(1,11)]
)
df

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20
row3   10   20   30   40   50   60   70   80   90   100

In [4]:
# (행, 열)
df.shape

(3, 10)

In [5]:
type(df.shape)

tuple

In [6]:
# 행 정보 출력
df.shape[0]

3

In [7]:
# 열 정보 출력
df.shape[1]

10

## 컬럼 정보 확인

In [8]:
df.columns

Index(['co1', 'co2', 'co3', 'co4', 'co5', 'co6', 'co7', 'co8', 'co9', 'co10'], dtype='object')

In [9]:
type(df.columns)

pandas.core.indexes.base.Index

In [10]:
df.columns[0]

'co1'

In [11]:
for co in df.columns:
    print(co)

co1
co2
co3
co4
co5
co6
co7
co8
co9
co10

In [15]:
df.dtypes

co1     int64
co2     int64
co3     int64
co4     int64
co5     int64
co6     int64
co7     int64
co8     int64
co9     int64
co10    int64
dtype: object

## 인덱스 정보 확인

In [12]:
df.index

Index(['row1', 'row2', 'row3'], dtype='object')

In [13]:
type(df.index)

pandas.core.indexes.base.Index

In [14]:
df.index[0]

'row1'

## 데이터프레임 정보
결측치 여부 확인 가능

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row1 to row3
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     3 non-null      int64
 1   co2     3 non-null      int64
 2   co3     3 non-null      int64
 3   co4     3 non-null      int64
 4   co5     3 non-null      int64
 5   co6     3 non-null      int64
 6   co7     3 non-null      int64
 7   co8     3 non-null      int64
 8   co9     3 non-null      int64
 9   co10    3 non-null      int64
dtypes: int64(10)
memory usage: 264.0+ bytes

## 데이터 추출
### 특정 열 추출

In [18]:
df['co2']

row1     3
row2     4
row3    20
Name: co2, dtype: int64

In [19]:
type(df['co2'])

pandas.core.series.Series

In [20]:
df['co10']

row1     19
row2     20
row3    100
Name: co10, dtype: int64

### 열 여러 개 추출

In [26]:
df[['co2', 'co10']]

      co2  co10
row1    3    19
row2    4    20
row3   20   100

In [30]:
df[['co1','co2','co3']]

      co1  co2  co3
row1    1    3    5
row2    2    4    6
row3   10   20   30

### 행 추출

In [31]:
# 끝 값 포함
df['row1':'row2']

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20

In [34]:
# 끝 값 제외 (내부적으로 부여되는 정수일 때만)
df[0:2]

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row1    1    3    5    7    9   11   13   15   17    19
row2    2    4    6    8   10   12   14   16   18    20

In [36]:
# 마지막 행 추출
df['row3':'row3']

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row3   10   20   30   40   50   60   70   80   90   100

In [37]:
df[-1:]

      co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
row3   10   20   30   40   50   60   70   80   90   100

### 특정 행, 열 추출

In [46]:
# 열 -> 행
df[['co4', 'co5']]['row1':'row2']

      co4  co5
row1    7    9
row2    8   10

In [48]:
# 행 -> 열
df['row1':'row2'][['co4', 'co5']]

      co4  co5
row1    7    9
row2    8   10